q='asd'
bukva = [q for q in q]
cod = list(ord(q) for q in q)


if __name__ == '__main__':
    print(bukva)
    print(cod)

"""масть = ['черви', 'буби', 'пики', 'треф']
карта = ['Кароль' ,'Валет' ,'Туз']
Карты = ['%s %s' for m in масть for k in карта]"""# не работает строковое включение
q=(123, 456)
 w,e=q# как аргументы позиционные присвоятся
 w=123 , e=456
 ---------------___________________________________
 q=(23,56)
 divmod(*q) # звездочка -это распоковка инче была бы только одна переменная и ошибка
* запаковка и распоковка в скобках
_______________________________________________________

