На самом деле главное функциональное отличие между указанными двумя инструментами касается момента, когда они активизируются в рамках процесса создания классов. В предыдущей главе объяснялось, что декораторы классов запускаются после того,
как декорированный класс был создан. Таким образом, они часто применяются для
добавления логики, подлежащей выполнению во время создания экземпляров. Когда
декораторы классов снабжают класс линией поведения, то обычно делают это через
изменения или посредников, а не более непосредственное отношение